---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.Clear
source: html/66329747-434e-aabc-f037-e50b549d8ffe.htm
---
# Autodesk.Revit.DB.PaperSizeSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```